7767517
7 6
pnnx.Input               pnnx_input_0             0 1 0 #0=(1,1,28,28)f32
nn.Conv2d                convbn2d_0               1 1 0 1 bias=True dilation=(1,1) groups=1 in_channels=1 kernel_size=(5,5) out_channels=32 padding=(2,2) padding_mode=zeros stride=(1,1) @bias=(32)f32 @weight=(32,1,5,5)f32 $input=0 #0=(1,1,28,28)f32 #1=(1,32,28,28)f32
nn.ReLU                  conv.2                   1 1 1 2 #1=(1,32,28,28)f32 #2=(1,32,28,28)f32
nn.MaxPool2d             conv.3                   1 1 2 3 ceil_mode=False dilation=(1,1) kernel_size=(2,2) padding=(0,0) return_indices=False stride=(2,2) #2=(1,32,28,28)f32 #3=(1,32,14,14)f32
Tensor.view              Tensor.view_1            1 1 3 4 shape=(1,6272) $input=3 #3=(1,32,14,14)f32 #4=(1,6272)f32
nn.Linear                fc                       1 1 4 5 bias=True in_features=6272 out_features=10 @bias=(10)f32 @weight=(10,6272)f32 #4=(1,6272)f32 #5=(1,10)f32
pnnx.Output              pnnx_output_0            1 0 5 #5=(1,10)f32
